#include<stdio.h>
// Задача 8
// Направете програма, която ползва for за да отпечати числата от 1 до 10 всяко на
// нов ред.
// Модифицирайте, така че програмата да пропусне 5 и 7;

int main(){
    for(int i=1;i<=10;i++){
        for(int j=1;j<5;j++){
            for(int k=6;k>6 && k!=7 && k>7;k++){
                printf("%d %d %d",i, j, k);
            }
        }
    }
}
